//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Scene.h
//!
//! @brief  シーンの抽象クラスのヘッダファイル
//!
//! @date   2018/11/14
//!
//! @author S.Takaki
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

// 多重インクルードの防止 ==================================================
#pragma once




// クラスの定義 ============================================================

// <シーン> ----------------------------------------------------------
class Scene
{
	// メンバ関数の宣言
	public:
		// コンストラクタ
		Scene() = default;

	public:
		//派生先で自由に設定してよい

		// デストラクタ
		virtual ~Scene() = default;

	public:
		// 派生先で宣言する必要がある = 0

		// 操作
		virtual void Initialize() = 0;
		virtual void Update() = 0;
		virtual void Render() = 0;
		virtual void Finalize() = 0;
};
